loadTesting/bombardService.yml

//To run this test open bash/cmd in this directory and run in console; artillery run bombardService.yml
{config: {
        target: "http://localhost:3004/recruits",
            phases: [{
                duration: 30,
                arrivalRate: 3
            }]},
    
    scenarios: [{
        flow: [{
            get: { url: "/" },
            post: {url: "/newRecruit",
                json: [
                    {
                        "ean": 'CG1',
                        "name": 'Nut',
                        "qtyReq": '1',
                        "stockQty": '40',
                        "productPrice": '40',
                        "custoRef": 'test@test.com'
                    },
                    {
                        "ean": 'CG2',
                        "name": 'Sling',
                        "qtyReq": '1',
                        "stockQty": '20',
                        "productPrice": '1',
                        "custoRef": 'test@test.com'
                    }]
            }
        }]
    }]
}